# -*- coding: utf-8 -*-
# -*- mode: org -*-
#+Title:  Introduction to Bayesian Statistics
#+Author: Arnaud Legrand\medskip\newline\logoInstitutions
#+DATE:  \vspace{3cm}\JDEVlogo SMPE lecture\newline January 2023\newline\begin{overlayarea}{1.05\linewidth}{0cm}\vspace{-3.2cm}\hfill{\mylogo}\end{overlayarea}\vspace{-1.0cm}
#+LANGUAGE: en
#+STARTUP: beamer indent inlineimages logdrawer
#+TAGS: noexport(n)

#+PROPERTY: header-args  :session :eval never-export :exports both
#+DRAWERS: latex_headers

:latex_headers:
#+LaTeX_CLASS: beamer
#+LATEX_CLASS_OPTIONS: [10pt,presentation,xcolor={usenames,dvipsnames,svgnames,table}]
# # aspectratio=169
#+OPTIONS:   H:2 num:t toc:nil \n:nil @:t ::t |:t ^:nil -:t f:t *:t <:t
#+LATEX_COMPILER: lualatex -shell-escape
#+LATEX_HEADER: \usedescriptionitemofwidthas{bl}
#+LATEX_HEADER: \usepackage[T1]{fontenc}
#+LATEX_HEADER: \usepackage[utf8]{inputenc}
#+LATEX_HEADER: \usepackage{figlatex}
#+LATEX_HEADER: \usepackage[french]{babel}
#+LATEX_HEADER: %\usepackage{DejaVuSansMono}
#+LATEX_HEADER: \usepackage{ifthen,amsmath,amstext,gensymb,amssymb}
#+LATEX_HEADER: \usepackage{relsize}
#+LATEX_HEADER: \usepackage{boxedminipage,xspace,multicol}
#+LATEX_HEADER: %%%%%%%%% Begin of Beamer Layout %%%%%%%%%%%%%
#+LATEX_HEADER: \ProcessOptionsBeamer
#+LATEX_HEADER: \usetheme[numbering=fraction,titleformat=smallcaps,progressbar=frametitle]{metropolis}
#+LATEX_HEADER: \usepackage{fontawesome}
#+LATEX_HEADER: \usecolortheme[named=BrickRed]{structure}
#+LATEX_HEADER: %%%%%%%%% End of Beamer Layout %%%%%%%%%%%%%
#+LATEX_HEADER: \usepackage{array}
#+LATEX_HEADER: \newcolumntype{L}[1]{>{\raggedright\let\newline\\\arraybackslash\hspace{0pt}}m{#1}}
#+LATEX_HEADER: \newcolumntype{C}[1]{>{\centering\let\newline\\\arraybackslash\hspace{0pt}}m{#1}}
#+LATEX_HEADER: \newcolumntype{R}[1]{>{\raggedleft\let\newline\\\arraybackslash\hspace{0pt}}m{#1}}

#+LATEX_HEADER: \usepackage{verbments}
#+LATEX_HEADER: \usepackage{xcolor}
#+LATEX_HEADER: \usepackage{color}
** R code                                                         :noexport:
  #+begin_src R :results output :session *R* :exports none
  set.seed(42);
  gen_binom_fixed = function(n1,n2) {
      set.seed(42);
      return(sample(c(rep(0,n1),rep(1,n2)),n1+n2))
  }
  Comb = function(n,k) {
      if(n==0 || k==0) { return(1);}
      return(prod(((n-k+1):n)/(1:k)))
  }
  bernouilli_likelihood = function(pi,n1,n2,triangular_prior=F) {
      prior = 1
      if(triangular_prior) {
          prior = (2-4*abs(pi-1/2));
          prior = prior*((1+n2)/(n1+n2+1)); #Hack the normalisation for triangular prior
      }
      return(prior*pi^n2*(1-pi)^n1*Comb(n1+n2,n1)*(n1+n2+1))
     #*factorial(n1+n2)/factorial(n1)/factorial(n2)
  }
  ## bernouilli_likelihood(.4,140,110)
  ## bernouilli_likelihood(.44,140,110)
  ## bernouilli_likelihood(.5,140,110)
  ## bernouilli_likelihood(.56,140,110)
  ## bernouilli_likelihood(.44,140,110)/
  ## bernouilli_likelihood(.44,140,110,triangular_prior=T)
  ## print("")
  ## bernouilli_likelihood(.4,0,0)
  #+end_src

  #+RESULTS:

  #+begin_src R :results output graphics :file images/bayesian/babel_images/density_coin_0_0.pdf :exports results :width 6 :height 2.5 :session *R* 
  library(ggplot2)
  require(gridExtra)

  plot_coin = function(n1,n2, prior=T, likelihood = T, triangular_prior=F) {
#      if(n1==0 && n2==0) {n1=1; n2=1;}
      dataY=data.frame(Y=gen_binom_fixed(n1,n2));
      dataY$ypos=(.25+.5*runif(nrow(dataY)))*nrow(dataY)/2;
      dataY$xpos=(.9*dataY$Y+.1*runif(nrow(dataY)));
      p1 = ggplot(dataY, aes(x=Y)) + 
        geom_histogram(binwidth=.1, boundary=0, color="black", fill="gray") + 
        geom_point(aes(y=ypos,x=xpos),alpha=.4) +
        theme_bw() + xlim(0,1)# + ylim(0,5)
#      plot_histogram(gen_binom_fixed(n1,n2),xmin=0,xmax=1,ymax=5, ypos=.3, binwidth=.1)
      p2 = ggplot(data=data.frame()) + ylim(0,15) + theme_bw() + xlim(0,1) + xlab(expression(pi)) + ylab("density");
      if(prior) {
          p2 = p2 + geom_area(data=data.frame(Y=c(0,1)), stat = "function", 
                            fun = bernouilli_likelihood, fill="blue", alpha=.2, 
                            args=list(n1=0,n2=0,triangular_prior=triangular_prior));
      } 
      if(likelihood) {
          p2 = p2 + geom_area(data=data.frame(Y=c(0,1)), stat = "function", 
                            fun = bernouilli_likelihood, fill="red", alpha=.4, 
                            args=list(n1=n1,n2=n2,triangular_prior=triangular_prior));
      } 
      return(grid.arrange(p1, p2, ncol=2));
  }
#  plot_coin(0,0, prior=T, likelihood=F)
  plot_coin(0,0,likelihood=F)
  #+end_src

  #+RESULTS:
  [[file:images/bayesian/babel_images/density_coin_0_0.pdf]]

  #+name: coin_values
  |  n1 |  n2 |
  |-----+-----|
  |   0 |   1 |
  |   1 |   1 |
  |   1 |   2 |
  |   1 |   3 |
  |   2 |   3 |
  |   2 |   4 |
  |   3 |   4 |
  |  10 |  13 |
  |  30 |  35 |
  | 110 | 140 |

  #+begin_src R :results output :session *R* :exports both :var coin_values=coin_values
  for(i in 1:nrow(coin_values)) {
      n1 = coin_values[i,]$n1;
      n2 = coin_values[i,]$n2;
      pdf(file=paste0("images/bayesian/babel_images/density_coin_",n1,"_",n2,".pdf"),width=6,height=2.5);
      plot(plot_coin(n1,n2));
      dev.off();
  }
  pdf(file=paste0("images/bayesian/babel_images/density_tcoin_0_0.pdf"),width=6,height=2.5);
  plot(plot_coin(0,0,triangular_prior=T,likelihood=F));
  dev.off();
  for(i in 1:nrow(coin_values)) {
      n1 = coin_values[i,]$n1;
      n2 = coin_values[i,]$n2;
      pdf(file=paste0("images/bayesian/babel_images/density_tcoin_",n1,"_",n2,".pdf"),width=6,height=2.5);
      plot(plot_coin(n1,n2,triangular_prior=T));
      dev.off();
  }
  #+end_src

  #+RESULTS:
  : png 
  :   2

#+begin_src R :results output :session *R* :exports both
Comb(250,110)/2**250
#+end_src

#+RESULTS:
: [1] 0.008357182

#+begin_src R :results output :session *R* :exports none
s=0
for(k in 1:110) {
    s = s+ Comb(250,k)/2**250
}
s
#+end_src

#+RESULTS:
: [1] 0.03321058

** Initial Belief and First Observations
#+LaTeX: \begin{columns}\begin{column}{.6\linewidth}
  # #+ATTR_BEAMER: :overlay <+->
  - Model: $Y \sim \Norm(\mu,\sigma)$
  - Prior: $\mu \sim \Unif(0,20)$ and $\sigma \sim \Unif(0,5)$
#+LaTeX: \end{column}\begin{column}{.4\linewidth}
  #+ATTR_LATEX: :width \linewidth :center nil
  [[file:images/bayesian/babel_images/density_mu_sigma1_prior.pdf]]
#+LaTeX: \end{column}\end{columns}\pause

#+begin_src R :results output :session *R* :exports both
set.seed(162);
n=20; mu=12.5; sigma=1.6;
Y=rnorm(n, mean=mu, sd=sigma);
Y
#+end_src

#+RESULTS:
:  [1] 13.899247 12.951346 12.164091 10.869858 13.075777 12.552552 15.446823
:  [8] 11.920264 12.849875  9.367122 12.083848 13.852930 12.740590  9.674321
: [15] 11.489182 12.195024 13.946985  9.220992 11.821921  9.347013
** Exploiting information (Normal model)
#+begin_src R :results output :session *R* :exports results
print(paste("Mean:", mean(Y)))
print(paste("Standard Deviation:", sd(Y)))
#+end_src

#+RESULTS:
: [1] "Mean: 12.07348806679"
: [1] "Standard Deviation: 1.70127707382769"

\medskip

#+LaTeX: \begin{columns}\begin{column}[t]{.5\linewidth}\centering
  Distribution of observations $Y$
#+Beamer: \only<1>{%
  #+ATTR_LATEX: :width \linewidth :center nil
  [[file:images/bayesian/babel_images/hist1.pdf]]
#+Beamer: }\only<2>{%
  #+ATTR_LATEX: :width \linewidth :center nil
  [[file:images/bayesian/babel_images/hist1_1.pdf]]
#+Beamer: }\only<3>{%
  #+ATTR_LATEX: :width \linewidth :center nil
  [[file:images/bayesian/babel_images/hist1_2.pdf]]
#+Beamer: }\only<4>{%
  #+ATTR_LATEX: :width \linewidth :center nil
  [[file:images/bayesian/babel_images/hist1_3.pdf]]
#+Beamer: }\only<5>{%
  #+ATTR_LATEX: :width \linewidth :center nil
  [[file:images/bayesian/babel_images/hist1_4.pdf]]
#+Beamer: }\only<6->{%
  #+ATTR_LATEX: :width \linewidth :center nil
  [[file:images/bayesian/babel_images/hist1.pdf]]
#+Beamer: }

#+LaTeX: \end{column}\begin{column}[t]{.5\linewidth}\centering
  Posterior distribution
  #+LaTeX: \uncover<8>{(Zoom)}
  #+Beamer: \only<2>{%
    #+ATTR_LATEX: :width \linewidth :center nil
    [[file:images/bayesian/babel_images/density_mu_sigma_2d_1.pdf]]
  #+Beamer: }\only<3>{%
    #+ATTR_LATEX: :width \linewidth :center nil
    [[file:images/bayesian/babel_images/density_mu_sigma_2d_2.pdf]]
  #+Beamer: }\only<4>{%
    #+ATTR_LATEX: :width \linewidth :center nil
    [[file:images/bayesian/babel_images/density_mu_sigma_2d_3.pdf]]
  #+Beamer: }\only<5>{%
    #+ATTR_LATEX: :width \linewidth :center nil
    [[file:images/bayesian/babel_images/density_mu_sigma_2d_4.pdf]]
  #+Beamer: }\only<6>{%
    #+ATTR_LATEX: :width \linewidth :center nil
    [[file:images/bayesian/babel_images/density_mu_sigma_2d.pdf]]
  #+Beamer: }\only<7>{%
    #+ATTR_LATEX: :width \linewidth :center nil
    [[file:images/bayesian/babel_images/density_mu_sigma1.pdf]]
  #+Beamer: }\only<8>{%
    #+ATTR_LATEX: :width \linewidth :center nil
    [[file:images/bayesian/babel_images/density_mu_sigma1_zoom.pdf]]
  #+Beamer: }
#+LaTeX: \end{column}\end{columns}\pause

*** Graphs                                                       :noexport:
#+begin_src R :results output graphics :file images/bayesian/babel_images/hist1.pdf :exports results :width 4 :height 4 :session *R* 
p = plot_histogram(Y,xmin=0,xmax=20,ymax=.5);
p
#+end_src

#+RESULTS:
[[file:images/bayesian/babel_images/hist1.pdf]]

#+begin_src R :results output :session *R* :exports both
l3d = likelihood_3d(data, xmin=0, xmax=20, ymin=0, ymax=5, length=51);
l3d_examples = with(l3d, l3d[(x==5.2 & y==4),]);
l3d_examples = rbind(l3d_examples, with(l3d, l3d[(x==16 & y==.5),]));
l3d_examples = rbind(l3d_examples, with(l3d, l3d[(x==12 & y==.8),]));
l3d_examples = rbind(l3d_examples, with(l3d, l3d[(x==12 & y==2),]));
for(i in 1:nrow(l3d_examples)) {
    pdf(file=paste0("images/bayesian/babel_images/density_mu_sigma_2d_",i,".pdf"),width=4,height=4);
    plot(plot_likelihood_2d(l3d,l3d_examples[1:i,],background=F));
    dev.off();
    pdf(file=paste0("images/bayesian/babel_images/hist1_",i,".pdf"),width=4,height=4);
    p = plot_histogram(Y,xmin=0,xmax=20,ymax=.8);
    p = p + geom_area(data=data.frame(Y=c(0,20)), stat = "function", 
                      fun = dnorm, fill="red", alpha=.4, 
                      args=list(mean=l3d_examples[i,]$x, sd=l3d_examples[i,]$y));
    plot(p);
    dev.off();
}
#+end_src

#+RESULTS:

#+begin_src R :results output graphics :file images/bayesian/babel_images/density_mu_sigma_2d.pdf :exports both :width 4 :height 4 :session *R* 
plot_likelihood_2d(l3d,l3d_examples);
#+end_src

#+RESULTS:
[[file:images/bayesian/babel_images/density_mu_sigma_2d.pdf]]

#+begin_src R :results output graphics :file images/bayesian/babel_images/density_mu_sigma1.pdf :exports both :width 7 :height 7 :session *R* 
plot_likelihood_3d(likelihood_3d(Y))
#+end_src

#+RESULTS:
[[file:images/bayesian/babel_images/density_mu_sigma1.pdf]]

#+begin_src R :results output graphics :file images/bayesian/babel_images/density_mu_sigma1_zoom.pdf :exports both :width 7 :height 7 :session *R* 
plot_likelihood_3d(likelihood_3d(data, xmin=10, xmax=14, ymin=0, ymax=4, length=50))
#+end_src

#+RESULTS:
[[file:images/bayesian/babel_images/density_mu_sigma1_zoom.pdf]]

#+begin_src shell :results output :exports both
for i in images/bayesian/babel_images/density_mu_sigma*.pdf ; do
    pdfcrop $i $i ;
done
#+end_src

#+RESULTS:
#+begin_example
PDFCROP 1.38, 2012/11/02 - Copyright (c) 2002-2012 by Heiko Oberdiek.
==> 1 page written on `images/bayesian/babel_images/density_mu_sigma1.pdf'.
PDFCROP 1.38, 2012/11/02 - Copyright (c) 2002-2012 by Heiko Oberdiek.
==> 1 page written on `images/bayesian/babel_images/density_mu_sigma1_prior.pdf'.
PDFCROP 1.38, 2012/11/02 - Copyright (c) 2002-2012 by Heiko Oberdiek.
==> 1 page written on `images/bayesian/babel_images/density_mu_sigma1_zoom.pdf'.
PDFCROP 1.38, 2012/11/02 - Copyright (c) 2002-2012 by Heiko Oberdiek.
==> 1 page written on `images/bayesian/babel_images/density_mu_sigma_2d.pdf'.
PDFCROP 1.38, 2012/11/02 - Copyright (c) 2002-2012 by Heiko Oberdiek.
==> 1 page written on `images/bayesian/babel_images/density_mu_sigma_2d_1.pdf'.
PDFCROP 1.38, 2012/11/02 - Copyright (c) 2002-2012 by Heiko Oberdiek.
==> 1 page written on `images/bayesian/babel_images/density_mu_sigma_2d_2.pdf'.
PDFCROP 1.38, 2012/11/02 - Copyright (c) 2002-2012 by Heiko Oberdiek.
==> 1 page written on `images/bayesian/babel_images/density_mu_sigma_2d_3.pdf'.
PDFCROP 1.38, 2012/11/02 - Copyright (c) 2002-2012 by Heiko Oberdiek.
==> 1 page written on `images/bayesian/babel_images/density_mu_sigma_2d_4.pdf'.
#+end_example
** Single point estimate (Normal model)
#+begin_src R :results output :session *R* :exports results
print(paste("Mean:", mean(Y)))
print(paste("Standard Deviation:", sd(Y)))
#+end_src

#+RESULTS:
: [1] "Mean: 12.07348806679"
: [1] "Standard Deviation: 1.70127707382769"

 $$p(\mu,\sigma|y) \propto  \prod_{i=1}^n
  \frac{1}{\sigma\sqrt{2\pi}}\exp\left(-\frac{1}{2}\left(\frac{y_i-\mu}{2}\right)^2\right)\textcolor{gray}{.\frac{1}{100}}$$

- /Machine Learning/: Maximum Likelihood $|y$
  - $\mu_{MLE} = \frac{1}{n} \sum_{i=1}^n y_i$
  - $\sigma_{MLE} = \sqrt{\frac{1}{n} \sum_{i=1}^n (y_i-\mu_{MLE})^2}$
- /Frequentist/: ensure $\E[\mu_{F}] = \mu$ and $\E[\sigma_{F}^2] = \sigma^2$ 
  - $\mu_{F} = \frac{1}{n} \sum_{i=1}^n y_i$
  - $\sigma_{F} = \sqrt{\frac{1}{n-1} \sum_{i=1}^n (y_i-\mu_{F})^2}$
- /Bayesian/: sample the posterior
\vspace{4cm}
** TODO Generating new data
#+begin_src R :results output :session *R* :exports none
set.seed(57)
n = length(Y)
mu_f = mean(Y)
sigma_f = sd(Y)
Y_new=rnorm(10000, mean=mu, sd=sigma); # True distribution
Y_new_f=rnorm(10000, mean=mu_f, sd=sigma_f);  # Distribution using a fixed estimation
## Inspire from chap. 14, p.357 of BDA3 by Gelman et al. for this
tdf = n-1
Y_new_b=mu_f + rt(10000, df = tdf)*(tdf-2)/tdf*sqrt(sigma_f^2*(1+1)); # Bayesian posterior
## Y_new_b=rnorm(10000, mean=Y_new_b, sd=sqrt(31/20*sigma_f));
Y_df = data.frame(new=Y_new, new_f=Y_new_f, new_b=Y_new_b);
summary(Y_df)
sd(Y_df$new)
sd(Y_df$new_f)
sd(Y_df$new_b)
#+end_src

#+RESULTS:
#+begin_example
      new            new_f            new_b       
 Min.   : 6.65   Min.   : 6.119   Min.   : 2.348  
 1st Qu.:11.40   1st Qu.:10.930   1st Qu.:10.600  
 Median :12.49   Median :12.058   Median :12.071  
 Mean   :12.50   Mean   :12.071   Mean   :12.069  
 3rd Qu.:13.63   3rd Qu.:13.202   3rd Qu.:13.513  
 Max.   :18.17   Max.   :17.950   Max.   :21.581
[1] 1.609831
[1] 1.698424
[1] 2.263807
#+end_example

- \T: unknown parameter ($\mu=$ src_R[:exports results]{mu}
  {{{results(=12.5=)}}}, $\sigma=$ src_R[:exports results]{sigma} {{{results(=1.6=)}}})
- \Y: observation 
- \Th: single point estimate of \T ($\mu\approx$ src_R[:exports results]{round(mu_f,2)}
  {{{results(=12.07=)}}}, $\sigma\approx$ src_R[:exports results]{round(sigma_f,2)} {{{results(=1.7=)}}})
- \Yt: future observations\bigskip

#+RESULTS:

#+LaTeX: \begin{columns}\begin{column}[t]{.5\linewidth}\centering
Generating \Yt from \Th
#+begin_src R :results output graphics :file images/bayesian/babel_images/coin_new_frequentist.pdf :exports results :width 6 :height 4 :session *R* 
library(ggplot2)
ggplot(data=Y_df) + theme_bw() + 
    geom_histogram(aes(x=new), binwidth=.5, boundary=0, color="black", fill="gray") +
    geom_histogram(aes(x=new_f), binwidth=.5, boundary=0, color="black", fill="red", alpha=.4)
#+end_src

#+RESULTS:
[[file:images/bayesian/babel_images/coin_new_frequentist.pdf]]

(does not account for the uncertainty on \Th)
#+LaTeX: \end{column}\begin{column}[t]{.5\linewidth}\centering\pause
Generating \Yt from many $\Tt|y$
#+begin_src R :results output graphics :file images/bayesian/babel_images/coin_new_bayesian.pdf :exports results :width 6 :height 4 :session *R* 
ggplot(data=Y_df) + theme_bw() + 
    geom_histogram(aes(x=new), binwidth=.5, boundary=0, color="black", fill="gray") +
    geom_histogram(aes(x=new_b), binwidth=.5, boundary=0, color="black", fill="blue", alpha=.4)
#+end_src

#+RESULTS:
[[file:images/bayesian/babel_images/coin_new_bayesian.pdf]]

Noise on $y$ + uncertainty on $\theta$
#+LaTeX: \end{column}\end{columns}
** Posterior for a Uniform Model
#+begin_src R :results output :session *R* :exports results
summary(data)
#+end_src

#+RESULTS:
:    Min. 1st Qu.  Median    Mean 3rd Qu.    Max. 
:   9.221  11.334  12.180  12.073  12.982  15.447

#+ATTR_LATEX: :width 5cm :center nil
[[file:images/bayesian/babel_images/hist1.pdf]]
#+ATTR_LATEX: :width 5cm :center nil
# [[file:images/bayesian/babel_images/density_alpha_beta1.pdf]]

** Generating random number: direct method
#+begin_src R :results output graphics :file images/bayesian/babel_images/direct_gen_runif.pdf :exports none :width 6 :height 4 :session *R* 
hist(runif(1000))
#+end_src

#+RESULTS:
[[file:images/bayesian/babel_images/direct_gen_runif.pdf]]

#+begin_src R :results output graphics :file images/bayesian/babel_images/direct_gen_density.pdf :exports none :width 6 :height 4 :session *R* 
plot(dnorm,xlim=c(-5,5))
#+end_src

#+RESULTS:
[[file:images/bayesian/babel_images/direct_gen_density.pdf]]

#+begin_src R :results output graphics :file images/bayesian/babel_images/direct_gen_pdf.pdf :exports none :width 6 :height 4 :session *R* 
plot(pnorm,xlim=c(-5,5))
#+end_src

#+RESULTS:
[[file:images/bayesian/babel_images/direct_gen_pdf.pdf]]

#+begin_src R :results output graphics :file images/bayesian/babel_images/direct_gen_qf.pdf :exports none :width 6 :height 4 :session *R* 
plot(qnorm,xlim=c(0,1))
#+end_src

#+RESULTS:
[[file:images/bayesian/babel_images/direct_gen_qf.pdf]]

#+begin_src R :results output graphics :file images/bayesian/babel_images/direct_gen_rnorm.pdf :exports none :width 6 :height 4 :session *R* 
hist(rnorm(1000))
#+end_src

#+RESULTS:
[[file:images/bayesian/babel_images/direct_gen_rnorm.pdf]]

#+begin_src shell :results output :exports none
for i in images/bayesian/babel_images/direct_gen_*.pdf ; do
    pdfcrop $i $i ;
done
#+end_src

#+RESULTS:
#+begin_example
PDFCROP 1.38, 2012/11/02 - Copyright (c) 2002-2012 by Heiko Oberdiek.
==> 1 page written on `images/bayesian/babel_images/direct_gen_density.pdf'.
PDFCROP 1.38, 2012/11/02 - Copyright (c) 2002-2012 by Heiko Oberdiek.
==> 1 page written on `images/bayesian/babel_images/direct_gen_pdf.pdf'.
PDFCROP 1.38, 2012/11/02 - Copyright (c) 2002-2012 by Heiko Oberdiek.
==> 1 page written on `images/bayesian/babel_images/direct_gen_qf.pdf'.
PDFCROP 1.38, 2012/11/02 - Copyright (c) 2002-2012 by Heiko Oberdiek.
==> 1 page written on `images/bayesian/babel_images/direct_gen_rnorm.pdf'.
PDFCROP 1.38, 2012/11/02 - Copyright (c) 2002-2012 by Heiko Oberdiek.
==> 1 page written on `images/bayesian/babel_images/direct_gen_runif.pdf'.
#+end_example

# Wait, how does this work btw ?

- Input:\vspace{-1em}
  - $\Unif(0,1)$ \includepic{direct_gen_runif.pdf}
  - A target density $f_Y$  \includepic{direct_gen_density.pdf}
- 3 \textit{Easy} steps:
  1. Compute $F_Y(t) = \int_{-\infty}^t f_Y(y).dy$ \includepic{direct_gen_pdf.pdf}
  2. Compute the inverse $F_Y^{-1}$ \includepic{direct_gen_qf.pdf}
  3. Apply $F_Y^{-1}$ to your uniform numbers \includepic{direct_gen_rnorm.pdf}
Step 1 is generally quite complicated. The /prior/ makes it /even worse/.

Multi-dimensional densities: just as complicated unless the
law has a very particular structure
** A simple example

#+begin_src R :results output :session *R* :exports none
generate_dataset=function(intercept, coefficient, N, min_x=0, max_x=100, sigma=1){
    x = sample(min_x:max_x,N,replace=T) 
    y = coefficient * x + intercept + rnorm(N,sd=sigma)
    df = data.frame(x=x,y=y)
    return(df)
}
df=generate_dataset(50, -2, 500, sigma=15)
head(df)
#+end_src

#+RESULTS:
:    x           y
: 1 75 -108.999735
: 2 38  -48.453814
: 3  3   29.142740
: 4 52  -54.413985
: 5 27   -1.098467
: 6 90 -127.396345

#+begin_src R :results output graphics :file  images/bayesian/babel_images/stan_data.pdf :exports both :width 6 :height 4 :session *R* 
ggplot(df, aes(x, y))+geom_point(alpha=0.3) + theme_bw()
#+end_src

#+RESULTS:
[[file:images/bayesian/babel_images/stan_data.pdf]]
** Running STAN
#+begin_src R :results output :session *R* :exports both
data = list(N=nrow(df),x=df$x,y=df$y)
fit = sampling(sm,data=data, iter=500, chains=8)
#+end_src

#+RESULTS:
#+begin_example
SAMPLING FOR MODEL 'ea4b5a288cf5f1d87215860103a9026e' NOW (CHAIN 1).
Chain 1: Gradient evaluation took 7.6e-05 seconds
Chain 1: 1000 transitions using 10 leapfrog steps per transition would take 0.76 seconds.
Chain 1: Iteration:   1 / 500 [  0%]  (Warmup)
Chain 1: Iteration:  50 / 500 [ 10%]  (Warmup)
Chain 1: Iteration: 100 / 500 [ 20%]  (Warmup)
Chain 1: Iteration: 150 / 500 [ 30%]  (Warmup)
Chain 1: Iteration: 200 / 500 [ 40%]  (Warmup)
Chain 1: Iteration: 250 / 500 [ 50%]  (Warmup)
Chain 1: Iteration: 251 / 500 [ 50%]  (Sampling)
Chain 1: Iteration: 300 / 500 [ 60%]  (Sampling)
Chain 1: Iteration: 350 / 500 [ 70%]  (Sampling)
Chain 1: Iteration: 400 / 500 [ 80%]  (Sampling)
Chain 1: Iteration: 450 / 500 [ 90%]  (Sampling)
Chain 1: Iteration: 500 / 500 [100%]  (Sampling)
Chain 1:  Elapsed Time: 0.101632 seconds (Warm-up)
Chain 1:                0.044023 seconds (Sampling)
Chain 1:                0.145655 seconds (Total)

SAMPLING FOR MODEL 'ea4b5a288cf5f1d87215860103a9026e' NOW (CHAIN 2).
Chain 2: Gradient evaluation took 2e-05 seconds
Chain 2: 1000 transitions using 10 leapfrog steps per transition would take 0.2 seconds.
Chain 2: Iteration:   1 / 500 [  0%]  (Warmup)
Chain 2: Iteration:  50 / 500 [ 10%]  (Warmup)
Chain 2: Iteration: 100 / 500 [ 20%]  (Warmup)
Chain 2: Iteration: 150 / 500 [ 30%]  (Warmup)
Chain 2: Iteration: 200 / 500 [ 40%]  (Warmup)
Chain 2: Iteration: 250 / 500 [ 50%]  (Warmup)
Chain 2: Iteration: 251 / 500 [ 50%]  (Sampling)
Chain 2: Iteration: 300 / 500 [ 60%]  (Sampling)
Chain 2: Iteration: 350 / 500 [ 70%]  (Sampling)
Chain 2: Iteration: 400 / 500 [ 80%]  (Sampling)
Chain 2: Iteration: 450 / 500 [ 90%]  (Sampling)
Chain 2: Iteration: 500 / 500 [100%]  (Sampling)
Chain 2:  Elapsed Time: 0.094653 seconds (Warm-up)
Chain 2:                0.046095 seconds (Sampling)
Chain 2:                0.140748 seconds (Total)

SAMPLING FOR MODEL 'ea4b5a288cf5f1d87215860103a9026e' NOW (CHAIN 3).
Chain 3: Gradient evaluation took 1.9e-05 seconds
Chain 3: 1000 transitions using 10 leapfrog steps per transition would take 0.19 seconds.
Chain 3: Iteration:   1 / 500 [  0%]  (Warmup)
Chain 3: Iteration:  50 / 500 [ 10%]  (Warmup)
Chain 3: Iteration: 100 / 500 [ 20%]  (Warmup)
Chain 3: Iteration: 150 / 500 [ 30%]  (Warmup)
Chain 3: Iteration: 200 / 500 [ 40%]  (Warmup)
Chain 3: Iteration: 250 / 500 [ 50%]  (Warmup)
Chain 3: Iteration: 251 / 500 [ 50%]  (Sampling)
Chain 3: Iteration: 300 / 500 [ 60%]  (Sampling)
Chain 3: Iteration: 350 / 500 [ 70%]  (Sampling)
Chain 3: Iteration: 400 / 500 [ 80%]  (Sampling)
Chain 3: Iteration: 450 / 500 [ 90%]  (Sampling)
Chain 3: Iteration: 500 / 500 [100%]  (Sampling)
Chain 3:  Elapsed Time: 0.057807 seconds (Warm-up)
Chain 3:                0.052244 seconds (Sampling)
Chain 3:                0.110051 seconds (Total)

SAMPLING FOR MODEL 'ea4b5a288cf5f1d87215860103a9026e' NOW (CHAIN 4).
Chain 4: Gradient evaluation took 1.9e-05 seconds
Chain 4: 1000 transitions using 10 leapfrog steps per transition would take 0.19 seconds.
Chain 4: Iteration:   1 / 500 [  0%]  (Warmup)
Chain 4: Iteration:  50 / 500 [ 10%]  (Warmup)
Chain 4: Iteration: 100 / 500 [ 20%]  (Warmup)
Chain 4: Iteration: 150 / 500 [ 30%]  (Warmup)
Chain 4: Iteration: 200 / 500 [ 40%]  (Warmup)
Chain 4: Iteration: 250 / 500 [ 50%]  (Warmup)
Chain 4: Iteration: 251 / 500 [ 50%]  (Sampling)
Chain 4: Iteration: 300 / 500 [ 60%]  (Sampling)
Chain 4: Iteration: 350 / 500 [ 70%]  (Sampling)
Chain 4: Iteration: 400 / 500 [ 80%]  (Sampling)
Chain 4: Iteration: 450 / 500 [ 90%]  (Sampling)
Chain 4: Iteration: 500 / 500 [100%]  (Sampling)
Chain 4:  Elapsed Time: 0.06965 seconds (Warm-up)
Chain 4:                0.056319 seconds (Sampling)
Chain 4:                0.125969 seconds (Total)

SAMPLING FOR MODEL 'ea4b5a288cf5f1d87215860103a9026e' NOW (CHAIN 5).
Chain 5: Gradient evaluation took 2e-05 seconds
Chain 5: 1000 transitions using 10 leapfrog steps per transition would take 0.2 seconds.
Chain 5: Iteration:   1 / 500 [  0%]  (Warmup)
Chain 5: Iteration:  50 / 500 [ 10%]  (Warmup)
Chain 5: Iteration: 100 / 500 [ 20%]  (Warmup)
Chain 5: Iteration: 150 / 500 [ 30%]  (Warmup)
Chain 5: Iteration: 200 / 500 [ 40%]  (Warmup)
Chain 5: Iteration: 250 / 500 [ 50%]  (Warmup)
Chain 5: Iteration: 251 / 500 [ 50%]  (Sampling)
Chain 5: Iteration: 300 / 500 [ 60%]  (Sampling)
Chain 5: Iteration: 350 / 500 [ 70%]  (Sampling)
Chain 5: Iteration: 400 / 500 [ 80%]  (Sampling)
Chain 5: Iteration: 450 / 500 [ 90%]  (Sampling)
Chain 5: Iteration: 500 / 500 [100%]  (Sampling)
Chain 5:  Elapsed Time: 0.107826 seconds (Warm-up)
Chain 5:                0.043495 seconds (Sampling)
Chain 5:                0.151321 seconds (Total)

SAMPLING FOR MODEL 'ea4b5a288cf5f1d87215860103a9026e' NOW (CHAIN 6).
Chain 6: Gradient evaluation took 4.7e-05 seconds
Chain 6: 1000 transitions using 10 leapfrog steps per transition would take 0.47 seconds.
Chain 6: Iteration:   1 / 500 [  0%]  (Warmup)
Chain 6: Iteration:  50 / 500 [ 10%]  (Warmup)
Chain 6: Iteration: 100 / 500 [ 20%]  (Warmup)
Chain 6: Iteration: 150 / 500 [ 30%]  (Warmup)
Chain 6: Iteration: 200 / 500 [ 40%]  (Warmup)
Chain 6: Iteration: 250 / 500 [ 50%]  (Warmup)
Chain 6: Iteration: 251 / 500 [ 50%]  (Sampling)
Chain 6: Iteration: 300 / 500 [ 60%]  (Sampling)
Chain 6: Iteration: 350 / 500 [ 70%]  (Sampling)
Chain 6: Iteration: 400 / 500 [ 80%]  (Sampling)
Chain 6: Iteration: 450 / 500 [ 90%]  (Sampling)
Chain 6: Iteration: 500 / 500 [100%]  (Sampling)
Chain 6:  Elapsed Time: 0.06351 seconds (Warm-up)
Chain 6:                0.053801 seconds (Sampling)
Chain 6:                0.117311 seconds (Total)

SAMPLING FOR MODEL 'ea4b5a288cf5f1d87215860103a9026e' NOW (CHAIN 7).
Chain 7: Gradient evaluation took 1.8e-05 seconds
Chain 7: 1000 transitions using 10 leapfrog steps per transition would take 0.18 seconds.
Chain 7: Iteration:   1 / 500 [  0%]  (Warmup)
Chain 7: Iteration:  50 / 500 [ 10%]  (Warmup)
Chain 7: Iteration: 100 / 500 [ 20%]  (Warmup)
Chain 7: Iteration: 150 / 500 [ 30%]  (Warmup)
Chain 7: Iteration: 200 / 500 [ 40%]  (Warmup)
Chain 7: Iteration: 250 / 500 [ 50%]  (Warmup)
Chain 7: Iteration: 251 / 500 [ 50%]  (Sampling)
Chain 7: Iteration: 300 / 500 [ 60%]  (Sampling)
Chain 7: Iteration: 350 / 500 [ 70%]  (Sampling)
Chain 7: Iteration: 400 / 500 [ 80%]  (Sampling)
Chain 7: Iteration: 450 / 500 [ 90%]  (Sampling)
Chain 7: Iteration: 500 / 500 [100%]  (Sampling)
Chain 7:  Elapsed Time: 0.066062 seconds (Warm-up)
Chain 7:                0.045438 seconds (Sampling)
Chain 7:                0.1115 seconds (Total)

SAMPLING FOR MODEL 'ea4b5a288cf5f1d87215860103a9026e' NOW (CHAIN 8).
Chain 8: Gradient evaluation took 1.9e-05 seconds
Chain 8: 1000 transitions using 10 leapfrog steps per transition would take 0.19 seconds.
Chain 8: Iteration:   1 / 500 [  0%]  (Warmup)
Chain 8: Iteration:  50 / 500 [ 10%]  (Warmup)
Chain 8: Iteration: 100 / 500 [ 20%]  (Warmup)
Chain 8: Iteration: 150 / 500 [ 30%]  (Warmup)
Chain 8: Iteration: 200 / 500 [ 40%]  (Warmup)
Chain 8: Iteration: 250 / 500 [ 50%]  (Warmup)
Chain 8: Iteration: 251 / 500 [ 50%]  (Sampling)
Chain 8: Iteration: 300 / 500 [ 60%]  (Sampling)
Chain 8: Iteration: 350 / 500 [ 70%]  (Sampling)
Chain 8: Iteration: 400 / 500 [ 80%]  (Sampling)
Chain 8: Iteration: 450 / 500 [ 90%]  (Sampling)
Chain 8: Iteration: 500 / 500 [100%]  (Sampling)
Chain 8:  Elapsed Time: 0.090898 seconds (Warm-up)
Chain 8:                0.048248 seconds (Sampling)
Chain 8:                0.139146 seconds (Total)
Inference for Stan model: ea4b5a288cf5f1d87215860103a9026e.
8 chains, each with iter=500; warmup=250; thin=1; 
post-warmup draws per chain=250, total post-warmup draws=2000.

                mean se_mean   sd     2.5%      25%      50%      75%    97.5%
intercept      49.12    0.04 1.31    46.53    48.24    49.13    50.00    51.68
coefficient    -1.96    0.00 0.02    -2.01    -1.98    -1.96    -1.95    -1.92
sigma          15.48    0.01 0.48    14.56    15.15    15.47    15.79    16.44
lp__        -1630.71    0.04 1.14 -1633.61 -1631.32 -1630.42 -1629.85 -1629.36
            n_eff Rhat
intercept     997 1.00
coefficient   979 1.00
sigma        1057 1.00
lp__          840 1.01

Samples were drawn using NUTS(diag_e) at Wed May 22 22:30:52 2019.
For each parameter, n_eff is a crude measure of effective sample size,
and Rhat is the potential scale reduction factor on split chains (at 
convergence, Rhat=1).
#+end_example
** Inspecting results
#+begin_src R :results output :session *R* :exports both
print(fit)
#+end_src

#+RESULTS:
#+begin_example
                mean se_mean   sd     2.5%      25%      50%      75%    97.5%
intercept      49.12    0.04 1.31    46.53    48.24    49.13    50.00    51.68
coefficient    -1.96    0.00 0.02    -2.01    -1.98    -1.96    -1.95    -1.92
sigma          15.48    0.01 0.48    14.56    15.15    15.47    15.79    16.44
lp__        -1630.71    0.04 1.14 -1633.61 -1631.32 -1630.42 -1629.85 -1629.36
            n_eff Rhat
intercept     997 1.00
coefficient   979 1.00
sigma        1057 1.00
lp__          840 1.01

Samples were drawn using NUTS(diag_e) at Wed May 22 22:30:52 2019.
For each parameter, n_eff is a crude measure of effective sample size,
and Rhat is the potential scale reduction factor on split chains (at 
convergence, Rhat=1).
#+end_example
